/*******************************************************************************
 * 2014, All rights reserved.
 *******************************************************************************/

/**
 * Package ru.malik.economics.model.
 * <p>
 * Класс продукции — изделия производимое прдприятием
 * Единица измерения
 * Класс работника
 * Класс "ресурс". Аналог термина "Экономический ресурс". Например, людские ресурсы или материальные ресурсы.
 * Партия товара
 * Номенклатура — базовый класс всех вещей.
 * Работа, которая имеет объем. Например: пропилить 200мм бруса или сварить 1000мм шва.
 * Калькуляция продукта
 * Материапльный ресурс. Т.е. это некий товар в каком-то объеме
 * Человеский ресурс, который состоит из работника и объема человеко*часов
 * Класс "работа". Например: работа по отрезке бруска; работа по зачистке швов.
 * Профессия. Например: столяр, плотник, сварщик
 * Профессии разбитые на уровни
 * </p>
 * 
 * @author Малик
 */
package ru.malik.economics.model;

